## production: cloudfront
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                      |
|----------|------------------------------------------------|
| recreate | `aws_route53_record.assets-notification-CNAME` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.assets-notification-CNAME must be replaced
-/+ resource "aws_route53_record" "assets-notification-CNAME" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "assets.notification.canada.ca" -> (known after apply)
      ~ id                               = "Z1XG153PQF3VV5_assets.notification.canada.ca_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "assets.notification.canada.ca"
      ~ zone_id                          = "Z1XG153PQF3VV5" -> "/hostedzone/Z07701011ICTZVSX5P68J" # forces replacement
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.assets-notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.asset_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.assets_cdn"]

22 tests, 19 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
